USE BooksDB
GO

IF OBJECT_ID('dbo.Authors') IS NOT NULL
    INSERT INTO dbo.Authors(Name_author, Birthday)
        VALUES ('Хемингуэй Эрнест', '07/21/1899'), 
               ('Воннегут Курт', '11/11/1922'),
               ('Твен Марк', '11/30/1835'),
               ('Диккенс Чарльз', '02/07/1812'),
               ('Шекспир Уильям', '04/26/1564'),
               ('Остин Джейн', '12/16/1775'),
               ('Блейк Уильям', '11/28/1757'),
               ('Вульф Вирджиния', '01/25/1882'),
               ('Киплинг Редьярд', '12/30/1865'),
               ('Кэрролл Льюис', '01/27/1832')

SELECT * FROM dbo.Authors

IF OBJECT_ID('dbo.Publishing_house') IS NOT NULL
    INSERT INTO dbo.Publishing_house (Publish, City)
        VALUES ('Оникс', 'Москва'),
               ('АСТ', 'Москва'),
               ('Питер', 'Санкт-Петербург'),
               ('Айрис-пресс', 'Москва'),
               ('Дрофа', 'Москва'),
               ('Высшая школа', 'Москва'),
               ('Лань', 'Москва'),
               ('Эксмо', 'Москва'),
               ('Альпина Паблишер', 'Москва'),
               ('Инфра-М', 'Москва')

SELECT * FROM dbo.Publishing_house

IF OBJECT_ID('dbo.Deliveries') IS NOT NULL
    INSERT INTO dbo.Deliveries (Name_delivery, Name_company, Address, Phone, INN)
        VALUES ('Иванов И.И.', 'Яндекс', 'Москва, ул. Маяковского, 15', 89001234567, '1234567890'),
               ('Петров П.П', 'Delivery club', 'Москва, ул. Герцена, 26', 89012345678, '2345678901'),
               ('Сидоров С.С.', 'Mail доставка', 'Москва, ул. Маяковского, 15', 89023456789, '3456789012'),
               ('Игнатов И.И.', 'Wildberries', 'Москва, ул. Маяковского, 15', 89034567890, '4567890123'),
               ('Афанасьев А.А.', 'Озон', 'Москва, ул. Маяковского, 15', 89045678901, '5678901234'),
               ('Платонов П.П.', 'Деловые линии', 'Москва, ул. Маяковского, 15', 89056789012, '6789012345'),
               ('Васильев В.В.', 'CDEK', 'Москва, ул. Маяковского, 15', 89067890123, '7890123456'),
               ('Николаев Н.Н.', 'Boxberry', 'Москва, ул. Маяковского, 15', 89078901234, '8901234567'),
               ('Алексеев А.А.', 'Скороход', 'Москва, ул. Маяковского, 15', 89089012345, '9012345678'),
               ('Дмитриев Д.Д.', 'Грузовичок', 'Москва, ул. Маяковского, 15', 89090123456, '0123456789')

SELECT * FROM dbo.Deliveries

IF OBJECT_ID('dbo.Books') IS NOT NULL
    INSERT INTO dbo.Books (Title_book, Code_author, Pages, Code_publish)
        VALUES ('По ком звонит колокол', 1, 305, 10),
               ('Механическое пианино', 2, 501, 9),
               ('Приключения Тома Сойера', 3, 285, 8),
               ('Повесть о двух городах', 4, 315, 7),
               ('Король Лир', 5, 427, 6),
               ('Эмма', 6, 517, 5),
               ('Книга Тэль', 7, 461, 4),
               ('Миссис Деллоуэй', 8, 517, 3),
               ('Семь морей', 9, 282, 2),
               ('История с узелками', 10, 528, 1)

SELECT * FROM dbo.Books

IF OBJECT_ID('dbo.Purchases') IS NOT NULL
    INSERT INTO dbo.Purchases (Code_book, Date_order, Code_delivery, Type_purchase, Cost, Amount)
        VALUES (1, '01/31/2022', 10, 0, 10.05, 30),
               (2, '02/28/2022', 9, 1, 11.03, 3),
               (3, '03/27/2022', 8, 0, 8.51, 40),
               (4, '04/26/2022', 7, 1, 7.49, 4),
               (5, '05/25/2022', 6, 0, 10.25, 25),
               (6, '06/24/2022', 5, 1, 11.24, 5),
               (7, '07/23/2022', 4, 0, 5.15, 18),
               (8, '08/22/2022', 3, 1, 3.21, 4),
               (9, '09/21/2022', 2, 0, 8.52, 15),
               (10, '10/20/2022', 1, 1, 10, 3)
    
SELECT * FROM dbo.Purchases